In [1]:
import pandas as  pd

In [2]:
df = pd.read_csv('Desktop/DA_csv _files/StudentsPerformance.csv')

In [3]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
r, c = df.shape
print(f'{r} rows and {c} columns')

1000 rows and 8 columns

In [6]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [16]:
genders_df = df.groupby('gender')

no_of_females = genders_df.get_group('female')['race/ethnicity'].count()

In [17]:
no_of_males = genders_df.get_group('male')['race/ethnicity'].count()